snlkuharlocal/src/Catalogs/БанковскиеСчета/БанковскиеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БанковскиеСчета</name>
  <comment>(Общ)</comment>
  <owners>Catalog.Организации</owners>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.Подразделения</owners>
  <attributes>
    <name>НомерСчета</name>
    <comment>(Общ) Номер расчетного счета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкДляРасчетов</name>
    <comment>(Регл) Банк, в случае непрямых расчетов</comment>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстКорреспондента</name>
    <comment>(Регл) Текст &quot;Плательщик\Получатель&quot; в платежных документах</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстНазначения</name>
    <comment>(Общ) Текст назначения платежа</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСчета</name>
    <comment>(Общ) Расчетный, депозитный, ссудный, иной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <comment>(Общ) Валюта, в которой хранятся денежные средства</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаРазрешения</name>
    <comment>(Регл) Номер и дата разрешения открытия счета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <comment>(Общ) Дата открытия счета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <comment>(Общ) Дата закрытия счета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МесяцПрописью</name>
    <comment>(Общ) Указывать в дате документа месяц прописью</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезКопеек</name>
    <comment>(Общ) Указывать сумму без копеек, если она в целых рублях</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДляОграниченияПравДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияДляОграниченияПравДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеНаименованиеОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРасчетныйСчетБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеНаименованиеБанкаПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьВФилиал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЗатратДляБанковскойКомиссии</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>21</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПраваДоступа</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>РедактированиеДокументов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПросмотрДокументов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/БанковскиеСчета/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
		//крохин начало 23.01.2012
	Если НЕ ОбменДанными.Загрузка Тогда
	ВыгрузитьВТЦ();
	КонецЕсли;
	//крохин конец 23.01.2012

	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры

 Процедура ВыгрузитьВТЦ()
//выгрузим контрагента в филиалы, если необходимо
ТЗ=Новый ТаблицаЗначений;
ТЗ.Колонки.Добавить("КодУзла");
ВерхнийУровень = Владелец;
Если Владелец.Метаданные().Имя <> "Контрагенты" Тогда
Возврат;
КонецЕсли;
Пока НЕ ВерхнийУровень.Пустая()  Цикл
	Для Каждого КодУзла Из ВерхнийУровень.РегиональныеУзлы Цикл
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.КодУзла = КодУзла.КодУзла;
КонецЦикла;
ВерхнийУровень = ВерхнийУровень.Родитель;
КонецЦикла;
ТЗ.Свернуть("КодУзла");
//из складских баз выгружаем только в ЦО
Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
ТЗ.Очистить();
СтрокаТЗ = ТЗ.Добавить();
СтрокаТЗ.КодУзла = "SNL";
КонецЕсли;
Если Тз.Количество() <> 0 Тогда
СписокУзловПолучателей=Новый Массив;	
	Для Каждого строкаТЗ Из ТЗ Цикл
			СписокУзловПолучателей.Добавить(ПланыОбмена.Основной.НайтиПоКоду(СтрокаТЗ.КодУзла));	
		КонецЦикла;
	Для Н = 0 По СписокУзловПолучателей.Количество()-1 Цикл
	ЭтотОбъект.ОбменДанными.Получатели.Добавить(СписокУзловПолучателей.Получить(Н));	
	КонецЦикла;
	//ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ЭтотОбъект.Ссылка);		
КонецЕсли;
КонецПроцедуры


Процедура ЗаполнитьТекстКорреспондента() Экспорт

	мВладелец     = ЭтотОбъект.Владелец;

	Если ЗначениеНеЗаполнено(мВладелец) Тогда
		Возврат;
	КонецЕсли;

	ТипВладельца = ТипЗнч(мВладелец);
	Если ТипВладельца = Тип("СправочникСсылка.Контрагенты") Тогда
		СтрКорреспондента = СокрЛП(мВладелец.ПолноеНаименование);
	ИначеЕсли ТипВладельца = Тип("СправочникСсылка.Организации") Тогда
		СтрКорреспондента = СокрЛП(мВладелец.НаименованиеПолное);	
	КонецЕсли;	

	Если НЕ БанкДляРасчетов.Пустая() Тогда
		СтрКорреспондента = СтрКорреспондента + " р/с " + НомерСчета
			+ " в " + Банк + " " + Банк.Город;
	КонецЕсли;	

	ТекстКорреспондента = СтрКорреспондента;	

КонецПроцедуры
